class Config:
    MYSQL_CONFIG = {
        'host': 'pc-bp10t7s47hgv1e3wu.rwlb.rds.aliyuncs.com',
        'user': 'py',
        'password': 'py@168520',
        'database': 'crmeb'
    }
    # MYSQL_CONFIG = {
    #     'host': 'rm-bp1nb947ry26p25k46o.mysql.rds.aliyuncs.com',
    #     'user': 'root',
    #     'password': 'Zst&#$5682sc',
    #     'database': 'crmeb'
    # }

    STOP_WORDS = {'的', '了', '和', '与', '等', '是', '/个', '/箱', '/kg', '/斤', '/盒', ','# 通用无效词
    '的', '和', '是', '有', '在', '就', '及', '与', '或', '了', '嘛', '呀', '哦',
    # 商品描述中常见但没太大意义的修饰词
    '一箱', '一包', '一盒', '装', '款', '组', '组合', '套装', '装饰', '类型',
    '系列', '版本', '升级', '增强', '加强', '经典', '礼盒', '限量', '定制', '原装',
    # 尺寸、容量、数量等通用单位
    'ml', 'g', 'kg', '片', '包', '瓶', '盒', '袋', '件', '套', '支', '枚',
    '双', '条', '卷', '粒', '颗', '只',
    # 促销词汇
    '热销', '新品', '推荐', '限时', '秒杀', '包邮', '特价', '折扣', '优惠', '抢购',
    # 产地词（可选是否去除，看你业务需求）
    '国产', '进口', '原产地', '正品',
    # 电商常见补充词
    '商品', '品牌', '官方', '旗舰', '同款', '正装', '试用', '体验', '通用',
    # 时间相关词（不具区分度）
    '新款', '最新', '2024', '2023', '2022', '年款', '现货', '当天', '预售',
    # 其他常见 filler
    '大小', '颜色', '图案', '样式', '风格', '男女', '儿童', '学生', '家用', '办公', '户外'}

    USER_DICT = [
        "iPhone13", "Type-C", "充电器", "数据线", "手机壳","米斛","水洗","酒","茅台"
        "华为", "小米", "苹果", "三星", "OPPO",
        "Pro", "Max", "Plus", "5G","土豆面","果蔬面","面膜",# 电子产品
        "手机", "笔记本电脑", "平板电脑", "智能手表", "耳机", "充电器", "数据线",

        # 服装
        "T恤", "衬衫", "牛仔裤", "运动鞋", "休闲鞋", "夹克", "羽绒服", "连衣裙",

        # 化妆品
        # "面霜", "精华液", "爽肤水",  "口红", "粉底液", "眼影", "睫毛膏",

        # 食品
        "饼干", "薯片", "巧克力", "糖果", "方便面", "火腿肠", "牛奶", "果汁",

        # 家电
        "电视机", "冰箱", "洗衣机", "空调", "电饭煲", "微波炉", "吸尘器",

        # 尺寸
        "去油","控油","水油","油性","精油","无硅油","鱼油","油渍","油滋"


        # 容量
        "128G", "256G", "512G", "1TB",

        # 材质
        "纯棉", "涤纶", "羊毛", "真皮", "人造革",

        # 规格
        "标准版", "豪华版", "至尊版", "限量版","大豆油"
        # 颜色

        #品牌
        "米妹妹","阿道夫","草本二四","官方正品","顺丰包邮","海天","迈卡罗","九阳","金龙鱼","MIMEIMEI","米里尔",
        '摩托车',
        '包裹',
        '+',
        '片',
        '提',
        '卷',
        '袋',
        'ml',
        '罐',
        '%',
        '瓶',
        '度',
        '克',
        'g',
        '公斤',
        '礼盒装',
        '礼盒',
        '两盒',
        '个',
        '产品',
        '型号',
        '尺寸',
        '明细',
        '件',
        '件数',
        '体积',
        '使用时间',
        '克数',
        '克重',
        '内存',
        '内容',
        '净含量',
        '净含量（每瓶）',
        '包装',
        '种类',
        '单位',
        '双',
        '口味',
        '只',
        '台',
        '名称',
        '含量',
        '味道',
        '品名',
        '块',
        '选择',
        '大小',
        '套',
        '套装',
        '套餐',
        '容量',
        '容量(ml)',
        '数量',
        '尺码',
        '条数',
        '形状',
        '支',
        '整箱',
        '无',
        '有效期',
        '材质',
        '极致系列',
        '标达系列',
        '桶',
        '款式',
        '毫升',
        '活动',
        '版式',
        '瓶装',
        '白色',
        '盒',
        '盒数',
        '码数',
        '箱',
        '类型',
        '紫色',
        '组',
        '组合',
        '绿色',
        '色号',
        '花型',
        '图案',
        '花色',
        '礼包',
        '袋装',
        '规格名',
        '每盒',
        '货号',
        '重量',
        '银色',
        '口径',
        '系列',
        '颜色',
        '分类',
        '规格',
        '香味',
        '香型',
        '香调',
        '黑色',
        '默认',
        "米白色", "米黑色", "S码", "M码", "L码", "XL码", "XXL码", "黑色", "白色", "金色", "银色", "红色", "蓝色",
        "粉色",
    ]



