class Config:
    MYSQL_CONFIG = {
        'host': 'pc-bp10t7s47hgv1e3wu.rwlb.rds.aliyuncs.com',
        'user': 'py',
        'password': 'py@168520',
        'database': 'crmeb'
    }
    # MYSQL_CONFIG = {
    #     'host': 'rm-bp1nb947ry26p25k46o.mysql.rds.aliyuncs.com',
    #     'user': 'root',
    #     'password': 'Zst&#$5682sc',
    #     'database': 'crmeb'
    # }

    STOP_WORDS = set(['的', '了', '和', '与', '等', '是','/个','/箱','g','kg','ml','/斤'])

    USER_DICT = [
        "iPhone13", "Type-C", "充电器", "数据线", "手机壳",
        "华为", "小米", "苹果", "三星", "OPPO",
        "Pro", "Max", "Plus", "5G","土豆面","果蔬面","面膜",# 电子产品
        "手机", "笔记本电脑", "平板电脑", "智能手表", "耳机", "充电器", "数据线",

        # 服装
        "T恤", "衬衫", "牛仔裤", "运动鞋", "休闲鞋", "夹克", "羽绒服", "连衣裙",

        # 化妆品
        "面霜", "精华液", "爽肤水",  "口红", "粉底液", "眼影", "睫毛膏",

        # 食品
        "饼干", "薯片", "巧克力", "糖果", "方便面", "火腿肠", "牛奶", "果汁",

        # 家电
        "电视机", "冰箱", "洗衣机", "空调", "电饭煲", "微波炉", "吸尘器","黑色", "白色", "金色", "银色", "红色", "蓝色", "粉色",

        # 尺寸
        "S码", "M码", "L码", "XL码", "XXL码",

        # 容量
        "128G", "256G", "512G", "1TB",

        # 材质
        "纯棉", "涤纶", "羊毛", "真皮", "人造革",

        # 规格
        "标准版", "豪华版", "至尊版", "限量版",
        # 颜色
        "米白色",
        #品牌
        "米妹妹","阿道夫","草本二四","官方正品","顺丰包邮","海天","迈卡罗","九阳","金龙鱼","MIMEIMEI"
    ]



