class Config:
    MYSQL_CONFIG = {
        'host': 'rm-bp1nb947ry26p25k46o.mysql.rds.aliyuncs.com',
        'user': 'root',
        'password': 'Zst&#$5682sc',
        'database': 'crmeb'
    }

    STOP_WORDS = set(['的', '了', '和', '与', '等', '是'])

    # STOP_WORDS
    # 主要功能：
    # - 过滤无意义词语
    # - 减少索引大小
    # - 提高搜索效率
    # - 提高搜索准确性

    # 实际效果：
    # 商品名称："苹果手机壳的保护套"
    # 建立索引时：
    # - 有停用词：['苹果', '手机', '壳', '保护', '套']
    # - 无停用词：['苹果', '手机', '壳', '的', '保护', '套']

    USER_DICT = [
        "iPhone13", "Type-C", "充电器", "数据线", "手机壳",
        "华为", "小米", "苹果", "三星", "OPPO",
        "Pro", "Max", "Plus", "5G"
    ]

    #USER_DICT = [
    #     "iPhone14",  # 产品型号
    #     "华为mate",  # 品牌系列
    #     "RTX4090",  # 显卡型号
    #     "蓝牙耳机",  # 产品类别
    # ]

    # 未添加自定义词典时：
    # 可能分词结果：['华为', 'mate', '60', 'pro', '手机']
    # 添加自定义词典后：
    # 分词结果：['华为mate', '60', 'pro', '手机']

    # 1.
    # 提高准确性：
    # - 准确识别商品名称
    # - 避免错误分词
    # - 提高搜索匹配度
    # 2.
    # 解决专业词汇：
    # - 新产品名称
    # - 技术术语
    # - 品牌词汇
    # 3.
    # 优化搜索体验：
    # - 更准确的搜索结果
    # - 更好的用户体验

